In [1]:
import pandas as pd
import numpy as np

In [2]:
csvpath = "./Resources/items.csv" # YOUR CODE HERE

In [3]:
df = pd.read_csv(csvpath)

In [5]:
df.tail()

   Item Number   Cost  Quantity
0         2468  $2.99       250
1         1357    NaN       300
2         9753  $3.47       350
3         9753  $3.47       350

In [6]:
df.isnull()

   Item Number   Cost  Quantity
0        False  False     False
1        False   True     False
2        False  False     False
3        False  False     False

In [9]:
df.isna().sum().sum()

1

In [13]:
# drops the entire row
df.dropna()

   Item Number   Cost  Quantity
0         2468  $2.99       250
2         9753  $3.47       350
3         9753  $3.47       350

In [20]:
df = df.fillna("$1.50")

In [21]:
df

   Item Number   Cost  Quantity
0         2468  $2.99       250
1         1357  $1.50       300
2         9753  $3.47       350
3         9753  $3.47       350

# Handle duplicate data

In [22]:
df.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [24]:
df = df.drop_duplicates()

In [25]:
df

   Item Number   Cost  Quantity
0         2468  $2.99       250
1         1357  $1.50       300
2         9753  $3.47       350

In [26]:
df.sum()

Item Number              13578
Cost           $2.99$1.50$3.47
Quantity                   900
dtype: object

In [28]:
df.dtypes

Item Number     int64
Cost           object
Quantity        int64
dtype: object

In [30]:
df.replace("$1.50", "$1.99")

   Item Number   Cost  Quantity
0         2468  $2.99       250
1         1357  $1.99       300
2         9753  $3.47       350

In [31]:
df["Cost"].replace("$", "@")

0    $2.99
1    $1.50
2    $3.47
Name: Cost, dtype: object

How to change an elemt in a file of the row - for instance the $

In [32]:
df["Cost"].str.replace("$","@")

0    @2.99
1    @1.50
2    @3.47
Name: Cost, dtype: object

In [33]:
df["Cost"].astype(float)

ValueError: could not convert string to float: '$2.99'

In [37]:
df["Cost"] = df["Cost"].str.replace("$","").astype(float)

C:\Users\adisu\AppData\Local\Temp\ipykernel_195844\1297137900.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Cost"] = df["Cost"].str.replace("$","").astype(float)

In [38]:
df

   Item Number  Cost  Quantity
0         2468  2.99       250
1         1357  1.50       300
2         9753  3.47       350

In [40]:
df.mean().to_frame()

                       0
Item Number  4526.000000
Cost            2.653333
Quantity      300.000000